{
  "intents": [
    {
      "tag": "about_me",
      "patterns": [
        "Tell me about yourself",
        "Introduce yourself",
        "What can you tell me about your background?"
      ],
      "responses": [
        "I'm Nikhil Shendge, an AI Engineer and Golang Developer. I have a strong expertise in artificial intelligence, machine learning, and programming languages like Python and Go. I have worked on various projects, including AI-related projects, web development, and computer vision. My passion lies in leveraging technology to solve complex problems and create innovative solutions."
      ]
    },
    {
      "tag": "skills",
      "patterns": [
        "What are your skills?",
        "Tell me about your skills",
        "What programming languages and tools are you proficient in?"
      ],
      "responses": [
        "I have proficiency in Python, R, JavaScript, and Go programming languages. In terms of AI, I have experience in machine learning, NLP, deep learning frameworks like TensorFlow and PyTorch, and data analysis tools like NumPy, Pandas, and Plotly. I am also skilled in web development using HTML, CSS, Bootstrap, and Python web frameworks like StreamLit and Flask. Additionally, I have knowledge of deployment platforms like Heroku and AWS."
      ]
    },
    {
      "tag": "projects",
      "patterns": [
        "Tell me about your projects",
        "What projects have you worked on?",
        "Can you describe your project experience?"
      ],
      "responses": [
        "I have worked on a variety of projects, including AI-related projects, web development, and computer vision. Some of my notable projects include:\n\n- Resume Parser & Skill Extractor using NLP\n- System for Predictive Maintenance\n- Insurance Claim Fraud Detection with ML & Python\n- Resume & LinkedIn Profile Inconsistency Check\n- OCR model for text identification & extraction\n- Thai/Hebrew Resume Parsing Project\n\nThese projects demonstrate my technical skills and problem-solving abilities."
      ]
    },
    {
      "tag": "internships",
      "patterns": [
        "Tell me about your internships",
        "What internships have you completed?",
        "Describe your internship experience"
      ],
      "responses": [
        "During my internships, I gained valuable experience in data mining, data visualization, NLP engineering, and LLM and transformer projects. Some of the internships I completed include:\n\n- Data Mining of survey data for market research forecasting\n- Using machine learning for fraud detection in the insurance industry\n- Data science internship at AiVariant\n- Data visualization and data management at Vitara Enterprises\n- NLP engineering at Xcelero\n\nThese internships helped me enhance my skills and apply them to real-world scenarios."
      ]
    },
    {
      "tag": "experience",
      "patterns": [
        "Tell me about your work experience",
        "What companies have you worked for?",
        "Describe your professional experience"
      ],
      "responses": [
        "I have gained professional experience as an AI engineer and Golang developer. I have worked on various projects as a freelancer, which involved AI, web development, and computer vision. Additionally, I have experience working as an associate data scientist at BlackCoffer. My responsibilities included developing AI-enabled solutions, creating visualizations using Power BI and Google Studio Analytics, and working on computer vision projects. These experiences have provided me with valuable insights and practical knowledge in different domains."
      ]
    },
     {
      "tag": "email",
      "patterns": [
        "Tell me your email.",
        "What is your gmail id?",
        "How can i mail you project details?"
      ],
      "responses": [
        "you can contact me through my mail id nikhilshendge1111@gmail.com"
      ]
    },
       {
      "tag": "phone",
      "patterns": [
        "Tell me your phone number.",
        "What is your phone number?",
        "How can i call you?"
      ],
      "responses": [
        "you can contact me through my phone number 7875517666"
      ]
    }
  ]
}
